In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

from sqlalchemy.engine import create_engine

%matplotlib notebook

In [2]:
%load_ext sql
%config SqlMagic.displaylimit=50
%config SqlMagic.autopandas=True

In [3]:
%sql postgresql://imdb:imdb_admin@postgres:5432/imdb_database

In [4]:
connection = create_engine('postgresql://imdb:imdb_admin@postgres:5432/imdb_database')

You will need local copies of the csv files that populate the tables in this database, please [download](https://arch.library.northwestern.edu/downloads/44558d72q?locale=en) and unpack the tarball before proceeding with this exercise.

# Introduction to SQL (Structured Query Language)

##### Version 0.1

***

By Scott Coughlin (Northwestern IT Research Computing Services)  
20 July 2022

[Session 15](https://github.com/LSSTC-DSFP/LSSTC-DSFP-Sessions/tree/main/Sessions/Session15) is primarily concerned with handling our data with efficiency.

Ideally, for any and every task we want to desire solutions that operate *faster*.

This can be accomplished many different ways:

$~~~~~~$build algorithms that execute faster

$~~~~~~$spread calculations over many different computers simultaneously

$~~~~~~$find a compact storage solution for the data so it can be accessed more quickly

In our introduction to SQL we will start with simple queries of existing tables, and discuss creating your own tables using `pandas` as a challenge problem.

## Problem 1) IMDb Data

Throughout the session we will use information from the [Internet Movie Database (IMDb)](https://www.imdb.com/) to illustrate various principles regarding databases.

A quick note on the provenance of this data. The files we have used to populate this data set are from [this website](https://relational.fit.cvut.cz/dataset/IMDb) and it may not be a list of every single movie on IMDb (there are no movies after 2004).

#### Please note that you can make an SQL command call from a jupyter cell by adding "%sql" in front of the SQL command you want to run, see examples below
```
## Perform a SQL command and see the results of the query
%sql SELECT * FROM imbd_movies;

## If you save to a variable, in this case "result", then the variable will be a `pandas` DataFrame based on the result of the query
result = %sql SELECT * FROM imdb_directors ORDER BY first_name LIMIT 10; 
```

Please execute the cell below to list all of the table names in the imbd_database database. You will want these table names to answer the questions that follow.

In [5]:
%sql \dt

 * postgresql://imdb:***@postgres:5432/imdb_database
4 rows affected.

   Schema                   Name   Type Owner
0  public         imdb_directors  table  imdb
1  public            imdb_movies  table  imdb
2  public  imdb_movies_directors  table  imdb
3  public     imdb_movies_genres  table  imdb

**Problem 1a**

Using SQL, SELECT 10 movies from the imbd_movies table. Select 10 directors from imbd_directors and order by `first_name`.

In [6]:
imdb_movies = %sql SELECT * FROM imdb_movies;
imdb_directors = %sql SELECT * FROM imdb_directors
imdb_movies_directors = %sql SELECT * FROM imdb_movies_directors
imdb_movies_genres = %sql SELECT * FROM imdb_movies_genres

 * postgresql://imdb:***@postgres:5432/imdb_database
355146 rows affected.
 * postgresql://imdb:***@postgres:5432/imdb_database
86880 rows affected.
 * postgresql://imdb:***@postgres:5432/imdb_database
371180 rows affected.
 * postgresql://imdb:***@postgres:5432/imdb_database
395119 rows affected.

In [11]:
table = %sql SELECT * FROM imdb_directors ORDER BY first_name LIMIT 10;

 * postgresql://imdb:***@postgres:5432/imdb_database
10 rows affected.

**Problem 1b**

Using SQL, how many movies are there? How many directors are there?

In [16]:
%sql SELECT COUNT(name) FROM imdb_movies

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

    count
0  355146

In [15]:
%sql SELECT COUNT(director_id) FROM imdb_directors

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

   count
0  86880

*Write your answer here*

**Problem 1c**

Using SQL, determine how many movies are there after the year 2000?

In [18]:
%sql SELECT COUNT(name) FROM imdb_movies WHERE year>2000

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

   count
0  39586

*Write your answer here*

**Problem 1d**

How many different movie genres are there?

In [20]:
%sql SELECT DISTINCT genre FROM imdb_movies_genres

 * postgresql://imdb:***@postgres:5432/imdb_database
21 rows affected.

          genre
0     Animation
1         Crime
2       Romance
3   Documentary
4       Mystery
5       Musical
6         Music
7     Film-Noir
8       Fantasy
9         Short
10        Adult
11       Horror
12        Drama
13       Action
14     Thriller
15       Sci-Fi
16      Western
17       Comedy
18    Adventure
19          War
20       Family

*Write your answer here*

## Problem 2) Joins

We started this exercise with a goal of being efficient. And yet, the data have been organized across 4 different files (each sheet is effectively a unique csv file).

**Problem 2a**

Join `imdb_movies` and `imdb_movies_genres` together

In [55]:
new_table = %sql SELECT * FROM imdb_movies as a INNER JOIN imdb_movies_genres as b ON a.movie_id = b.movie_id

 * postgresql://imdb:***@postgres:5432/imdb_database
395119 rows affected.

*write your answer here*

**Problem 2b**

Join `imdb_movies`, `imdb_movies_directors` and `imdb_directors` together

In [71]:
new_table = %sql SELECT * FROM imdb_movies as a \
INNER JOIN imdb_movies_directors as b ON a.movie_id=b.movie_id \
INNER JOIN imdb_directors as c ON b.director_id = c.director_id;

 * postgresql://imdb:***@postgres:5432/imdb_database
319125 rows affected.

In [72]:
new_table

,movie_id,name,year,rank,director_id,movie_id,director_id,first_name,last_name
0,131879,Goonda,1984,0.0,8,131879,8,Kodanda Rami Reddy,A.
1,179870,Kondaveeti Donga,1990,0.0,8,179870,8,Kodanda Rami Reddy,A.
2,247163,Palnati Simham,1985,0.0,8,247163,8,Kodanda Rami Reddy,A.
3,157146,Imperial Navy,1981,0.0,31,157146,31,Paul,Aaron
4,347746,Untamed Love,1994,0.0,31,347746,31,Paul,Aaron
...,...,...,...,...,...,...,...,...,...
319120,301476,Silah arkadaslari,1962,0.0,88777,301476,88777,Sinasi,Özonuk
319121,350837,Vatan fedaileri,1961,0.0,88777,350837,88777,Sinasi,Özonuk
319122,315351,Stopp (2001/II),2001,6.8,88781,315351,88781,Pål,Øie
319123,158959,Indbildt hanrej,1971,0.0,88787,158959,88787,Preben,Østerfelt
319124,307135,Soire musicale,1971,0.0,88787,307135,88787,Preben,Østerfelt

*write your answer here*

## Problem 3) Groups and Aggregates

Now that we know why the data has been organized in this way, we can leverage this unique structure in order to learn interesting properties of the data.

**Problem 3a**

In which year were the most movies made according to IMDb?

In [43]:
%sql SELECT year, COUNT(year) FROM imdb_movies GROUP BY year ORDER BY COUNT(year) DESC LIMIT 1

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

   year  count
0  2002  10337

*write your answer here*

**Problem 3b**

How many "Action" movies where made after the year 1980? Before the year 1980?

In [60]:
new_table

        movie_id                    name  year  rank  movie_id      genre
0             13  $21 a Day Once a Month  1941   0.0        13  Animation
1             13  $21 a Day Once a Month  1941   0.0        13      Short
2             18              $40,000.00  1996   9.6        18     Comedy
3             31                   $pent  2000   4.3        31      Drama
4             73              burbs, The  1989   5.9        73     Comedy
...          ...                     ...   ...   ...       ...        ...
395114    378593                 arkadas  1971   0.0    378593      Drama
395115    378599             kisilik ask  2004   0.0    378599      Drama
395116    378604     tekerlekli bisiklet  1962   0.0    378604      Drama
395117    378605        yetimin izdirabi  1956   0.0    378605      Drama
395118    378610                nc sayfa  1999   7.0    378610      Drama

[395119 rows x 6 columns]

In [63]:
%sql SELECT COUNT(genre) FROM imdb_movies as a INNER JOIN imdb_movies_genres as b ON a.movie_id = b.movie_id WHERE genre='Action' AND year>1980;

 * postgresql://imdb:***@postgres:5432/imdb_database
1 rows affected.

   count
0  10135

*write your answer here*

**Problem 3c**

Select all films made by `Scorsese`. How many are there?

In [85]:
%sql SELECT * FROM imdb_directors LIMIT 10;

 * postgresql://imdb:***@postgres:5432/imdb_database
10 rows affected.

   director_id          first_name    last_name
0            1                Todd            1
1            2                 Les  12 Poissons
2            3             Lejaren     a'Hiller
3            4                Nian            A
4            5            Khairiya    A-Mansour
5            6             Ricardo     A. Solla
6            8  Kodanda Rami Reddy           A.
7            9       Nageswara Rao           A.
8           10                Yuri           A.
9           11               Swamy       A.S.A.

In [94]:
%sql SELECT director_id, first_name, last_name, COUNT(director_id) FROM imdb_movies_directors as a INNER JOIN imdb_directors as b ON a.director_id=b.director_id GROUP BY director_id ORDER BY COUNT(director_id) DESC LIMIT 1;

 * postgresql://imdb:***@postgres:5432/imdb_database
(psycopg2.errors.AmbiguousColumn) column reference "director_id" is ambiguous
LINE 1: SELECT director_id, first_name, last_name, COUNT(first_name)...
               ^

[SQL: SELECT director_id, first_name, last_name, COUNT(first_name) FROM imdb_movies_directors as a INNER JOIN imdb_directors as b ON a.director_id=b.director_id GROUP BY director_id ORDER BY COUNT(director_id) DESC LIMIT 1;]
(Background on this error at: https://sqlalche.me/e/14/f405)

*write your answer here*

**Problem 3c**

According the the IMDb data, which director has directed the most movies?

In [ ]:
%sql SELECT COUNT(name) FROM imdb_movies as a INNER JOIN imdb_movies_directors as b ON a.movie_id=b.movie_id INNER JOIN imdb_directors as c ON b.director_id = c.director_id

*write your answer here*

**Problem 3d**

According the the IMDb data, which director has directed the most movies in each genre?

In [ ]:
%sql

*write your answer here*

## Challenge Problem) Make your own tables

**Problem 1a**

Create a new TABLE.

In [ ]:
%sql

**Problem 1b**

INSERT 3 rows into the TABLE you made above

In [ ]:
%sql

**Problem 1c**

Create a pandas DataFrame and save as a SQL table

*** hint look at the `pandas.to_sql` documentation and note that we already made a "connection" variable called `connection` ***